---
kind: type
id: T:Autodesk.Revit.DB.ExportColorMode
source: html/20b1158b-d5ab-057d-d780-a4870d0c2a5b.htm
---
# Autodesk.Revit.DB.ExportColorMode

An enumerated type listing export color mode.

## Syntax (C#)
```csharp
public enum ExportColorMode
```